app/controllers/frnds_controller.rb

SELECT "frnds".* FROM "frnds"
---
  def index
    @frnds = Frnd.all

INSERT INTO "frnds" ("first_name", "last_name", "Email", "phone_no", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @frnd = Frnd.new(frnd_params)
    # @frnd=current_user.frnds.build(frnd_params)
  #end

    respond_to do |format|
      if @frnd.save

UPDATE "frnds" SET "twitter" = ?, "updated_at" = ? WHERE "frnds"."id" = ?  [["twitter", "aa"], ["updated_at", "2022-02-23 09:39:50.230965"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @frnd.update(frnd_params)

DELETE FROM "frnds" WHERE "frnds"."id" = ?  [["id", 11]]
---
  def destroy
    @frnd.destroy

SELECT "frnds".* FROM "frnds" WHERE "frnds"."user_id" = ? AND "frnds"."id" = ? LIMIT ?  [["user_id", 8], ["id", 11], ["LIMIT", 1]]
---
  def correct_user
    @friend=current_user.frnds.find_by(id: params[:id])

SELECT "frnds".* FROM "frnds" WHERE "frnds"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def set_frnd
      @frnd = Frnd.find(params[:id])